#### SketchedCurveSlopeOption Enumeration

---

|  |
| --- |
| See Also |

The option determines the slop of the sketched run/landing.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public enum SketchedCurveSlopeOption ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration SketchedCurveSlopeOption ``` |

| Visual C++ |
| --- |
| ``` public enum class SketchedCurveSlopeOption ``` |

# Members

| Member name | Description |
| --- | --- |
| Auto | The slope of the sketched run/landing will be auto detected. |
| Flat | The slope of the sketched run/landing will be kept flat. |
| Sloped | The slope of the sketched run/landing will be specified by users. |

# See Also

Autodesk.Revit.DB.Architecture Namespace